# Build dependencies
brew 'cmake'
brew 'pkg-config'

brew 'assimp'
brew 'boost'
brew 'bullet'
brew 'eigen'
brew 'fcl'
#brew 'filament'
brew 'flann'
brew 'ipopt'
brew 'libccd'
brew 'nlopt'
brew 'octomap'
brew 'ode'
brew 'open-scene-graph'
#brew 'pagmo'  # disabled to reduce the build time
brew 'sdl2'
brew 'tinyxml2'
brew 'urdfdom'

# dartpy dependencies
brew 'pybind11'
brew 'numpy'
